#Дано выражение. Нужно посчитать его значение, учитывая приоритет операторов.

a = 5 + 2 * 3 - 4 / 2
b = (3 + 5) * (2 + 4) / 2
c = -3 + 6 / 2 * 4
d = 5 + 4 * 5 ** 2 + 7

print ("5 + 2 * 3 - 4 / 2 = ", a)
print ("(3 + 5) * (2 + 4) / 2 = ", b)
print ("-3 + 6 / 2 * 4 = ", c)
print ("5 + 4 * 5 ** 2 + 7 = ", d)