#Напишите первую программу, выводящую сообщение «Привет, мир!».

print ("hi")